# language: ru
Функция:  Проверка функциональности сайта Otus.ru

  Сценарий: Успешной авторизации
    Пусть Перейти на главную страницу

  Сценарий: Неудачной попытки авторизации на сайте

  Сценарий: Регистрация на сайте

  Сценарий: Восстановление пароля

  Сценарий: Проверка наличия курса "Java QA Engineer"

  Сценарий: Изменение данных профила (Имя и Фамилия)

  Сценарий: Добавление дополнительных каналов связи в профиле

  Сценарий: Отправка заявки на преподавание

  Сценарий: Смена автарки в профиле

  Сценарий: Проверка контактного номера телефона на сайте